/*************************************************************************************
 * 文 件 名:   04-常量.cpp
 * 创 建 者：  liming
 * 创建时间：  2021/7/17 20:14
*************************************************************************************/

#include<iostream>
using namespace std;

//常量的定义方式
//1.#define宏常量d
#define Day 7
//2.const修饰的变量

int main() {
	//Day = 14;   //错误，Day是常量，一旦修d改就会报错
	cout << "一周总共有：" << Day << "天" << endl;

	//2.const修饰的变了
	const int month = 12;
	//month = 24;  //错误，const修饰的变量也称为常量

	cout << "一年总共有：" << month << "个月份" << endl;
	system("pause");
	return 0;
}