/*************************************************************************************
 * 文 件 名:   08-实型(浮点型).cpp
 * 创 建 者：  liming
 * 创建时间：  2021/7/17 22:46
*************************************************************************************/

#include<iostream>
using namespace std;

int main() {
	//1.单精度 float:通常我们会在float后面加一个f，来明显的告诉它是单精度类型，否则默认它会认为是双精度
	//2.双精度 double
	//默认情况下，输出一个小数，会显示出6位有效数字
	float f1 = 3.1415926f;
	cout << "f1=" << f1 << endl;  //f1=3.14159

	double d1 = 3.1415926;
	cout << "d1="<<d1 << endl;  //d1=3.14159

	//C++中显示小数，它最多给你显示出来6位的有效数字

	//统计float和double占用的内存空间
	cout << "float占用内存空间为：" << sizeof(float) << endl;  //4个字节

	cout<<"double占用内存空间为：" <<sizeof(double)<< endl;   //8个字节

	//科学计数法
	float f2 = 3e2;  //3*10^2
	cout << "f2="<<f2<<endl;

	float f3 = 3e-2;

	cout << "f3=:"<<f3<<endl;

	system("pause");
	return 0;
}
